[
{"data": ["{\"@context\":\"https://schema.org\",\"@type\":\"LocalBusiness\",\"name\":\"Scottsdale Unified School District No 48\",\"image\":\"https://s3-media0.fl.yelpcdn.com/bphoto/Z77bvnG3hHtjttYF_q1Dow/l.jpg\",\"telephone\":\"(480) 484-8650\",\"address\":{\"streetAddress\":\"9313 N 95th Way\",\"addressLocality\":\"Scottsdale\",\"addressCountry\":\"US\",\"addressRegion\":\"AZ\",\"postalCode\":\"85258\"},\"review\":[]}"]},
{"data": ["{\"@context\":\"https://schema.org\",\"@type\":\"LocalBusiness\",\"name\":\"Scottsdale Education Center\",\"image\":\"https://s3-media0.fl.yelpcdn.com/bphoto/oO33NayRdltp1Fq5_EOhfA/l.jpg\",\"telephone\":\"(480) 538-0828\",\"address\":{\"streetAddress\":\"9151 East Bell Rd\\nSte 102\",\"addressLocality\":\"Scottsdale\",\"addressCountry\":\"US\",\"addressRegion\":\"AZ\",\"postalCode\":\"85260\"},\"review\":[{\"author\":\"Jeanne B.\",\"datePublished\":\"2021-02-23\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"I&apos;ve had my 2 oldest children prep for the ACT &amp; SAT.  Both got great scores!  They are doing Zoom sessions during covid which is wonderful too!  We have easy access to desired times &amp; days.  My daughter brushed up with a couple of sessions before taking the ACT again &amp; got a 35!  My son will do this as well before his SAT.  My middle school aged child has private tutoring every week &amp; has gone from struggling to a confident honor roll student.  We are so happy with our experiences at SEC.  Only positive results!\"},{\"author\":\"Joyce L.\",\"datePublished\":\"2019-12-18\",\"reviewRating\":{\"ratingValue\":1},\"description\":\"Our daughter did better on the ACT before she came to SEC for ACT test prep than after she spent 4 months with them! \\nNo feedback from them.  Waste of time and money. Can I rate them a zero?\"},{\"author\":\"Evan K.\",\"datePublished\":\"2019-02-25\",\"reviewRating\":{\"ratingValue\":2},\"description\":\"There are good people here who are capable tutors, but they need to figure out a better way to schedule students. I&apos;ve called to schedule maybe a dozen times over the past couple of months, and I can&apos;t recall a single time a human answered the phone. They also rarely call back in a timely manner. \\n\\nThere are great online scheduling software tools available these days. It&apos;s overdue for your facility to implement one. Either that or have a better phone scheduling setup. \\n\\nIf they figure that part out, I will happily increase my rating.\"},{\"author\":\"Amy W.\",\"datePublished\":\"2018-02-01\",\"reviewRating\":{\"ratingValue\":1},\"description\":\"Study Skills Class (a.k.a. Study Skills &amp; Learning Styles)\\n* Does your child struggle in school?\\n* Not living up his or her potential?\\n* Not turning in their work or not doing well on tests?\\n* Spending no time or too much time doing homework?\\n* Are you constantly fighting with your student to get them to do school work?\\n* Are they embracing the definition of insanity - doing the same thing over and over again and expecting a different outcome? \\n\\n.... My middle school child is struggling to... turn in home work, study for tests and organization, all of which, this is supposed to tackle. So I signed him up.  You get a FREE one on one assessment consultation, then 4 sessions (1 hour long).  $180 Plus an annual registration fee.  My child is worth the money, so we try it.\\n\\nAssessment:  I spoke to the head honcho at S.E.C., Dave, for our assessment.  He seemed very educated and enthusiastic that this class will change my child.   He stated that my child had some movement issues and he knew the perfect instructor for my child for this class. \\n\\n4 sessions (1 hour long):  Effective us of a Daily Planner; Taking Notes based on the Student&apos;s Learning Style; Memorization and Research Techniques; and, Prepping for Tests. Many students will continue with regularly scheduled homework support or subject tutoring.\\n\\nScheduling the sessions:  I called and scheduled the classes, all 4 of them.  They asked when it was convenient for me to bring him in.  I thought this was strange because Dave said he had a specific person for him, but maybe this person is always available, so I let it go.  I schedule two days for the first week, then two days for the second week.  I am not sure if we did all 4 session consecutively if it would have been any better. Probably not.\\n\\nSession 1-Plan of attack)  My child states that he sat at a very large table with many other instructors and many students, all in the same room.  To me this is a distraction -- not a good place for a child who is easily distracted.   I have no idea if my child got the instructor that Dave was referring to, but what can I do? This is also the session where they learn how to fill out the planner properly.  He says he took notes, filled out a worksheet and made a contract. \\n\\nSession 2-Taking Notes) I purchased the planner before this class, in hopes that it would make a difference.  My child states that he didn&apos;t learn anything new.  He also stated that a child complained for a long time about the classes they are taking and it was very annoying.  After session two, SEC asked for credentials for school login, to view grades, etc.\\n\\nSession 3-Research) My child admits to me that he only fills out the planner before going to his session at SEC so he won&apos;t get in trouble.  He tells me he is learning stuff that he already knows (easy bib).  Looking at his grades now, after three sessions (no improvement).  Still doing the same things.\\n\\nSession 4-Test Taking / Study Skills) Same thing, my child admits to me he still hasn&apos;t learned anything new.\\n\\nThis class did absolutely NOTHING for him.  After taking the classes, he is still doing the same things.  Big waste of money!    \\n\\nPersonally, I feel.... these changes could benefit S.E.C.\\n1st... I feel....This class should included the PLANNER that they teach to.  It&apos;s $10, just make the class $10 more expensive. I found out after the first session that it was NOT included.  I had to ask for it personally.  Nobody even asked me if we wanted it before the class. \\n\\n2nd... I feel....they should teach this class on a regular schedule, with the same kids, not a revolving schedule .  Meaning it should be offered weekly or bi-monthly option, like a scheduled class.  As for now, each class can have up to 3 students and not always the same 3 students.  I&apos;m not sure how the kids sit with one another, but to me this seems like it can be very distracting for a kid who is unfocused.  My child told me during one session, a kid complained how hard a specific class was for them and they discussed it for 30 minutes - How will this organize/help my child? \\n\\n3rd... I feel....The logon credentials should be asked for on the first day of class.  When they looked at my child&apos;s grades,   They sent me a report stating that they looked at my child&apos;s &quot;School Website&quot; classes/grades.  The report just stated the obvious, which was happening BEFORE we went there and I already knew about.\\n\\nI feel....If you don&apos;t know what is wrong with your child because you are clueless (haven&apos;t check grades, aren&apos;t around when child is supposed to be doing school work or have no time to figure it out), then maybe this class is for your child, otherwise, save your money.\"},{\"author\":\"Pam K.\",\"datePublished\":\"2016-06-03\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"I checked out 3 other establishments in the valley before my son &amp; I settled on SEC. Without even getting to know your kids&apos; abilities, the other guys try to sell you their ACT or SAT packages.\\n\\nSEC administered a test to see which test is better for your child. From there, they ascertain if a class makes sense. My son took a few private &amp; semi privates &amp; that&apos;s all he needed. I wound up only spending a fraction of the cost &amp; we were extremely happy with the results.\"},{\"author\":\"Krista C.\",\"datePublished\":\"2016-06-28\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"My daughter did the Middle school summer camp. It was incredible! She left there every day excited about what she had learned. HIghly recommend!\"},{\"author\":\"L A.\",\"datePublished\":\"2018-06-12\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"Excellent tutoring, excellent staff.  Impressed with tutors.  Very kind, caring, patience.  Our children have excelled on their tests and grades.  Thank you!!\"},{\"author\":\"Bradley J.\",\"datePublished\":\"2014-06-30\",\"reviewRating\":{\"ratingValue\":1},\"description\":\"Worst tutoring on earth. I spent 495.00 for the ACT prep and my son scored 3 points lower than before the tutoring. I do not even know how this is possible. I would recommend Kaplan. Our family friend sent their son and his score increased by 5 points. I sent an email and received no response.\\nBrad Johnson\"},{\"author\":\"Katie P.\",\"datePublished\":\"2017-08-24\",\"reviewRating\":{\"ratingValue\":2},\"description\":\"I had a great conversation with the owner initially about our son who is 17.  Our son needed SAT prep as well as a tutor for Algebra III.  We were hoping for 1-on-1 tutoring for some sessions, but the 1-on-1 turned out to be one tutor and one student in a room filled with other tutors and students, all talking at once.  Our son has 3 mild learning differences, dyslexia, ADHD and auditory processing.  While in the office to pay our bill, I mentioned to the receptionist that our son had taken one of the SAT prep tests with a lot of other talking &amp; lessons going on in the background, and that this was distracting for him, as he had several learning differences.  She immediately asked me to whisper about it.  What?  I have never been asked to talk about my children&apos;s learning disabilities in hushed tones.  It was as if that was a taboo subject to discuss in the office, even though there were only two other adults present, and they appeared to be staff.  Wow!!!  I have raised 4 children, 3 of whom are dyslexic and so am I.  I have never been uncomfortable or embarrassed to talk about learning differences.  Nor should anyone else.  I have raised my children to know themselves, strengths and struggles in all, to advocate for themselves and to understand that having a learning disability does not limit them in anyway!!!!  In fact, my kids are capable of anything, and have amazing gifts in the areas of music, art, English (yes!!!), sports, science and technology.  I have taught at some of the most amazing and prominent public and private schools, and never have I been &quot;shushed&quot; when it came to openly and honestly asking for what a child needs.  If this is a place that is testing children as well, I would definitely look elsewhere!  Look for a place that truly understand learning differences, gifts and struggles in all, and are not embarrassed to talk about it.  And look for a place where 1-on-1 is just that, in a quite space with few distractions.\"},{\"author\":\"Jennifer K.\",\"datePublished\":\"2014-03-04\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"Our son was taking the entrance exam to a private school and had never done a timed test.  The program and the tutors available with Scottsdale Education Center were extremely helpful, knowledgeable, kind and patient.  Our son did well on his pretests and I felt they were honest in their advise on how to help him improve.  He went on to not only gain acceptance to his school but was accepted with Honors - his HSPT score was in the top 5% - a testament to the time he spent with SEC.\"},{\"author\":\"Maura L.\",\"datePublished\":\"2014-10-29\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"We were incredibly happy with our experience at Scottsdale Education Center.  My daughter started there after taking the PSAT as a sophomore.  The tutors are excellent and the guidance from the VERY involved owners was invaluable. She was able to increase her PSAT score dramatically when she took the test as a junior.  The tutors were knowledgeable and very helpful whether it be PSAT tutoring, physics, calculus or english there was always an amazing tutoring available. I have recommended this business to at least 20 other families.\"},{\"author\":\"Ruchi K.\",\"datePublished\":\"2014-07-25\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"Scottsdale Education Center has an amazing range of college preparatory services - from tutoring for all classes to SAT prep to college counseling. Overall, I really appreciated their SAT and ACT practice tests, which significantly helped me improve my scores. Additionally, Kim Duckworth&apos;s personalized college counseling advice helped me narrow down my target college choices and plan my senior year to reach my goals. I am happy to say that I was accepted into multiple Ivy League schools and top universities with the help I received from the center. The teachers that work here are committed to making sure each student understands what they are learning and is working to their maximum capacity. I highly recommend trying out Scottsdale Education Center for help in any subject or test. All you need to bring with you is a motivated and &quot;can-do&quot; attitude!\"}],\"aggregateRating\":{\"@type\":\"AggregateRating\",\"ratingValue\":3.5,\"reviewCount\":12}}"]},
{"data": ["{\"@context\":\"https://schema.org\",\"@type\":\"LocalBusiness\",\"name\":\"Test Whisperer\",\"image\":\"https://s3-media0.fl.yelpcdn.com/bphoto/VRBU0IwDCBVhuho6y8P52Q/l.jpg\",\"telephone\":\"(602) 909-1345\",\"address\":{\"streetAddress\":\"5148 North 45th Pl\",\"addressLocality\":\"Phoenix\",\"addressCountry\":\"US\",\"addressRegion\":\"AZ\",\"postalCode\":\"85018\"},\"review\":[{\"author\":\"lisa k.\",\"datePublished\":\"2017-02-10\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"Adam is a true genius!  His ability to connect with each and every student and address their different learning needs is amazing. My son has done so much better on the SAT since Adam started working with him!  Thank you Adam for all you do!!!\"},{\"author\":\"Maeve L.\",\"datePublished\":\"2019-10-21\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"Adam is the best! His personalized help was extremely useful for me to identify my strengths and weaknesses. He gives specific strategies to practice with and think about while I&apos;m taking the test. Adam&apos;s guidance helped me walk into the testing room feeling confident and ready! I was able to raise my SAT score by 150 points. Thank you Adam!!\"}],\"aggregateRating\":{\"@type\":\"AggregateRating\",\"ratingValue\":5,\"reviewCount\":2}}"]},
{"data": ["{\"@context\":\"https://schema.org\",\"@type\":\"LocalBusiness\",\"name\":\"Interlingua\",\"image\":\"https://s3-media0.fl.yelpcdn.com/bphoto/MWQvMmW287zH2ScbcwLHmg/l.jpg\",\"telephone\":\"(602) 274-4441\",\"address\":{\"streetAddress\":\"5107 N 7th St\\nSte 2\",\"addressLocality\":\"Phoenix\",\"addressCountry\":\"US\",\"addressRegion\":\"AZ\",\"postalCode\":\"85014\"},\"review\":[{\"author\":\"Lauren G.\",\"datePublished\":\"2021-10-23\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"I&apos;ve been taking classes through Interlingua for over two years now and it has vastly improved my Spanish. The teachers are amazing and take into account your reasons for wanting to learn and where you are most likely going to apply the language (i.e. work or traveling to specific countries) when working on vocabulary. I love that the teachers are from different Spanish speaking countries so there&apos;s opportunity for exposure to different accents as well as to country specific vocabulary and idioms. The small student to teacher ratio is also really beneficial as it provides greater opportunity and more of a push for the students to practice speaking in Spanish. I&apos;ve become more fluent with my Spanish speaking in my two years at Interlingua than I ever was when I studied Spanish in high school and in a university.\"},{\"author\":\"Morrill B.\",\"datePublished\":\"2020-07-26\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"Amazing service. Excellent management. Cannot wait to get to know more about Interlingua and it&apos;s employees. Ana is a saint and is very sincere, genuine and nice.\"},{\"author\":\"Barni Q.\",\"datePublished\":\"2017-05-15\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"Great language school! I took two courses with Blanca and increased my Spanish skills. Great community and learning environment!\"},{\"author\":\"Sally O.\",\"datePublished\":\"2012-05-05\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"This is a wonderful establishment. I bought a groupon and I was uncertain, but after entering a class, I am hooked. Their instructors are great and their concepts are\\\\ amazing.  Check it out!  You won&apos;t be sorry!\"}],\"aggregateRating\":{\"@type\":\"AggregateRating\",\"ratingValue\":5,\"reviewCount\":4}}"]},
{"data": ["{\"@context\":\"https://schema.org\",\"@type\":\"LocalBusiness\",\"name\":\"Grand Canyon University\",\"image\":\"https://s3-media0.fl.yelpcdn.com/bphoto/CCGxNyhCencjNcUXsXU79w/l.jpg\",\"telephone\":\"(855) 428-5673\",\"address\":{\"streetAddress\":\"3300 W Camelback Rd\",\"addressLocality\":\"Phoenix\",\"addressCountry\":\"US\",\"addressRegion\":\"AZ\",\"postalCode\":\"85017\"},\"review\":[{\"author\":\"Abigail P.\",\"datePublished\":\"2022-10-19\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"Amazing school, wonderful staff, and an overall great experience. Everyone here is very helpful and willing to work with you if you run into any type of issue. I&apos;ve been going to this university for roughly 3 years and I have never had a problem with any of the staff or counselors. I&apos;ve been an online student the entire time, and just graduated with my bachelors degree from this school. I drove out to see my school for graduation, for the first time ever, and it&apos;s absolutely beautiful. Everyone is so kind and welcoming. I highly recommend this university because not only did I have a wonderful experience, but I also did not finish with a mound of debt under my belt.\"},{\"author\":\"Ernest E. D.\",\"datePublished\":\"2022-06-06\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"Lived here for a year and it changed my life for the good!\\nLearned alot about people and different perspectives on each life lived.\\nBecame Muslim when I left as all religions deserve a view.\"},{\"author\":\"Daniel M.\",\"datePublished\":\"2022-11-17\",\"reviewRating\":{\"ratingValue\":1},\"description\":\"If you are a motivated individual, have a career, and are looking for a way to wrap up your education quickly and expediently while you work, GCU is not for you.\\n\\nI decided to finish my degree at GCU. I am in the Army, so online school is the only real option for me.  GCU portrays itself as a friendly online platform. The user interface and classes are great. However, this is the extent of my praise. GCU made me feel like a second-class student. \\n\\nIn order to take more than two classes, you need to put in an appeal each time which can take weeks to months to get approved, which is too slow and has thrown me off my schedule to graduate in line with my career aspirations. They are guilty of FALSE ADVERTISING. You CAN NOT finish your degree in 2 years online with how long their appeal process takes. I have kept above a 3.8 GPA, so my grades were not a factor in this long process. This appeal system actively sabotages high-achieving, heavy-hitting, motivated students. It sucks your soul, and not in a good way. \\n\\nThe student service counselors are overtasked, and you&apos;ll only get to talk to them on the phone 10-20% of the time you really need it. \\n\\nAdditionally, I have tried to apply to another college in the meantime, and it took over a month for the transcripts to arrive in the mail. But now that I am wrapping up my time with GCU and am shooting for my master&apos;s with Notre Dame, GCU has taken weeks to send the transcript, and it still hasn&apos;t arrived. I have been to five colleges, and GCU is the ONLY ONE THAT DOES NOT SEND ELECTRONIC TRANSCRIPTS, which is utterly absurd in this day and age. The hassle I have to go through to be met where I am by the administration is exhausting. \\n\\nThe transcript department refused to give me credit for two of my transcripts, and the best advice my counselor could give me was to just have them sent again. This creates time and information gaps that amount to weeks because of the time it takes GCU to receive and review them. I wish I could talk to someone in the transcript department so that I could know what the actual issue is. I despise this process and detest that GCU forces me to go through it.\\n\\nYour only point of contact is your student counselor. They are your bottleneck, and it costs your time dearly. \\n\\nThe classes are excellent. However, the administration is inexcusably and abhorrently derelict in its responsibility to care for its students. I wish I had decided to finish my degree with another college because GCU has given me more than a few gray hairs over its ineptitude. GO SOMEWHERE ELSE!!!\"},{\"author\":\"Michele D.\",\"datePublished\":\"2022-08-21\",\"reviewRating\":{\"ratingValue\":1},\"description\":\"The Masters and what I learned were excellent.  However, once you complete the program, good luck with any follow through.\\n\\nA student survey asked about classes and there was a valid concern with one professor.  GCU never followed up nor even contacted me for additional information or if it was looked into.\\n\\nIf you need transcripts for future educational needs, forget it!!  I ordered transcripts over a month ago and apparently they were lost in the mail.  Since I couldn&apos;t seem to talk to a counselor on the phone, I emailed and every time, she said &quot;let me know if they don&apos;t come in by next week.&quot;  \\n\\nI called her supervisor on Thursday and she said the counselor would contact me for about an e transcript (which the same counselor told me they no longer offered) and I did not hear from her Friday.  \\n\\nAnyway, I am accepted to  a post MA program at another university and will not be able to enter their program if my last document, GCU transcript, does not article by Wednesday.\"},{\"author\":\"D N.\",\"datePublished\":\"2022-11-04\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"Best kept secret ever.  So happy my daughter found this school in her search. Safe environment and loving. Small class sizes and great faculty. Dorms are like real apartments.  I&apos;m from the Midwest and my daughter&apos;s roommates are from Phoenix and another from Pacific Northwest.  Couldn&apos;t be happier with that diversity.\"},{\"author\":\"Rolande D.\",\"datePublished\":\"2022-11-16\",\"reviewRating\":{\"ratingValue\":4},\"description\":\"How can I begin expressing my gratitude to GCU. I achieved one of my biggest accomplishments, I graduated in October 2022 with my bachelor&apos;s degree in nursing. I thanked my amazing professors and the faculty team providing me the teaching and support in completing my degree. Overall great experience! I am hoping to be back soon to start my master&apos;s degree.\"},{\"author\":\"Dan C.\",\"datePublished\":\"2022-10-18\",\"reviewRating\":{\"ratingValue\":1},\"description\":\"Not a very good experience for me at all. I would say about half of my instructors were not very helpful at all when it came to issues with the assignments. Not to mention they have 24 hours to respond to your concerns. So, if you have a problem on Sunday and the assignment is due Sunday they don&apos;t have to respond to your question until Monday. That means you will either get a reduction in your grade or get a zero which I received on the last assignment before I finished my degree. \\n\\nWhen I reached out to my counselor Lindsey Gonzolas when I had an issue in another class all she said was just fill out the review at the end of the class. She didn&apos;t address or care about my issue in any capacity. At one point, I was taking time off from school because I do missions for the military and she said &apos;just stop wasting time&quot; like she knows me and what was going on in my world. I think her job is just to collect money for the University.\\n\\nOne instructor was so bad when we were put into groups to complete an assignment one girl told me she cried over the way the instructor was treating her. She was going to take time away from the school to determine if she wanted to transfer or not. For a University to say they have Christian values and promote those values with their bible verses, you would think you could get a little more compassion and empathy from the instructors and counselors.\\n\\nAlso, if you want to\"},{\"author\":\"Kailah J.\",\"datePublished\":\"2022-11-04\",\"reviewRating\":{\"ratingValue\":1},\"description\":\"IF YOU HAVE AN EMOTIONAL SUPPORT ANIMAL DO NOT ATTEND!! Terrible school, and i mean TERRIBLE. I am an onground student who made the biggest mistake coming here. First, I am an out of state transfer from North Carolina, who flew in with my emotional support animal on the first day of move ins. I had to walk from the front of campus all the way to saguaro hall with two large suitecases and a Kitten in the 100 degree heat with no help finding my dorm. I walked Up to 3 different welcome team members, and each one of them walked away and ignored me as if i didn&apos;t exist. As this semester progresses and find several issues. My sink had no running water for over 2 weeks, despite contacting maintenance on the first day of move in&apos;s, we had to wash our hands in the sink in the common room or the shower. I then have issues with my roommate and suitemate. It started with the ABUSE of my emotional support animal. I alerted public safety, SDS, my RA and my RD - they did NOTHING! After this, I decided to go home for a mental break to come back to my fridge Mysteriously unplugged with everything spoiled inside. Again, alerted My RA&apos;s and they did nothing. Throughout the last 2 months I have BEGGED SDS for a room switch, i even said i would pay extra in necessary, and of course they have done NOTHING. I have been through 3 roommate mediations, an RD mediation, spoken with housing, residence life, public safety, and housing and they all have done ZERO to help. My mental health has declined to the point where going to class is the hardest thing i have ever had to do, my grades have suffered and my emotional support animal still has not fully recovered from the abuse he suffered. The professors will never respond to your halo messages, emails or phone calls so don&apos;t bother contacting them. SDS will ignore you for days and pass you around to multiple people in the office where you&apos;ll have to reexplain everything that&apos;s happened. Residence life won&apos;t even come out of the office to speak to you unless you have a serious breakdown and beg to speak someone. Housing will Charge you a $400 termination fee for wanting to leave the campus that gave you pure PTSD. GCU IS MORE THAN THE WORSE SCHOOL I HAVE EVER ATTENDED, THEY ONLY CARE ABOUT YOUR MONEY AND WHEN YOU STOP GIVING THEM MONEY THEY&apos;LL CHARGE EXTRA FEES AND HOLD YOUR TRANSCRIPT HOSTAGE EVEN AFTER PAYING THEM. \\n\\nI am leaving this school $10,000 in debt and only anxiety to show for it. \\nThanks GCU for the extra therapy sessions i now have to get for both me and my support animal.\"},{\"author\":\"Chrissy H.\",\"datePublished\":\"2022-08-09\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"My time was wonderful at GCU! As a completely online student, I of course created my own schedule. Weekly check-ins are a must and the dedication level to your degree is learned as you continue to grow with the college. I believe each class had its own &quot;vibe&quot; and I mean that in the sense that sometimes professors really were engaged the entire time. The rest left the work to you, but this is defined by your purpose and drive. \\n\\nIt took me 2.5 years to get my degree because I did one class at a time, but I really appreciate the support I received. I cannot express enough how attentive my student services counselor was. I would definitely recommend Grand Canyon University to those seeking continued higher education.\"},{\"author\":\"Kaitlynn G.\",\"datePublished\":\"2022-07-23\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"I just graduated from GCU with my Bachelors in Elementary Education &amp; Special Education. Overall, it was a great experience. The University gave me a significant discount because I was a Navy spouse and they supported me when I took time off for a major surgery. Go Lopes!\"},{\"author\":\"Mililani P.\",\"datePublished\":\"2022-08-02\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"As a new ADN graduate and started my orientation on the floor the online program made it easy for me to handle my everyday life. The instructors were all straightforward in what they expected from their classes which made it even easier!.\"},{\"author\":\"Atul S.\",\"datePublished\":\"2021-08-19\",\"reviewRating\":{\"ratingValue\":4},\"description\":\"Huge campus and well organized overall. Studying masters here and experience has been great as of now. Great amenities and nice faculty overall. I do understand that this can&apos;t be true about all the courses here but it is just my experience as if now. Has almost all infrastructure in-house and they are developing at a great pace. Plenty of accommodation and a large number of students are studying here, especially international students. The campus is very well maintained and feels classy overall. Had the good option of campus restaurants as well like panda express, chick-a-fila, subway, etc. One of the good option to study college in phoenix area.\"},{\"author\":\"Addie S.\",\"datePublished\":\"2022-01-29\",\"reviewRating\":{\"ratingValue\":2},\"description\":\"Not what it pretends to be. I was not impressed by their professors or their promises. No follow through. Waste of $8,000 for one semester. My soN got more out of the community college than here.\"},{\"author\":\"M. C.\",\"datePublished\":\"2021-12-17\",\"reviewRating\":{\"ratingValue\":1},\"description\":\"In 2020, I started the doctorate program at Grand Canyon University. I chose the Organizational Leadership program. I had high hopes that this institution would be an excellent fit.\\n \\nIn my fifth class, I was told to agree with woke, Marxist ideology. One specific assignment stated that we must agree with a teaching framework that promoted Marxist ideas (division and anarchy). We were to articulate how and why we would include Marxist ideas in our teaching practices. The assignment never asked if we agreed with it. We were told to agree with it. We had to explain how we were going to incorporate racist teaching strategies in our classroom. Students who did not comply with this demand faced reduced scores for thinking independently.\\n \\nAfter completing the assignment (without racist teaching ideas), the professor stated that I did not explain how I would divide my class by race. Secondly, the professor told me that I failed to incorporate social justice into my teaching practice. I told the professor I did not agree with Culturally Responsive Teaching. The professor redirected me to the expectations of the assignment and expressed no concern over the issue I presented. I actually asked the professor if students are required to lie to earn a good grade in the class. Essentially, those who do not agree are forced to lie to earn a good grade. \\n \\nIn the end, my final score for the class was dropped due to non-compliance and independent thinking; I disagree with the Marxist agenda. I filed a formal review of my grade with the review committee. I asked if the institution had ethical teaching practices. Shall it be acceptable for teachers to demand that students lie in order to pass their classes? Can students get marked down for adhering to ethical or biblical standards? Why should this even be an issue at an institution that claims to be &quot;Christian&quot;? Shall professors ask students to violate the Bible? [Social Justice is not Biblical Justice. See Owen Strachan, Voddie Baucham, John MacArthur, Scott David Allen, Thaddeus Williams, Allie B. Stuckey, and Alisa Childers.]\\n \\nAdditionally, the textbook was awful. It was woke, Marxist indoctrination. I was shocked and saddened that a &quot;Christian&quot; institution would approve of such a divisive, unbiblical textbook. The professor pointed students to Dr. Geneva Gay who advocates for social justice, promotes the teaching of whiteness, and encourages racial division in the classroom. Per the professor, Gay&apos;s framework was a positive example that students were to follow. This is what Christian leaders are supposed to emulate per Grand Canyon University?\\n \\nIf you are curious if the institution still believes in these themes, search for &quot;culturally responsive&quot; in the staff profile page. More than one teacher pops up. You will find these ideas right there on the GCU website. Or, email the academic dean of your area of expertise, ask them specifically if these Marxist ideas are still being taught at GCU (whiteness, white privilege, racial injustice, diversity, inclusion, and equity). \\n \\nIf you are uncertain about Culturally Responsive Teaching, Christopher Rufo released a video on Critical Race Theory and he calls out Culturally Responsive Teaching. PragerU also has a video about education that highlights Culturally Responsive Teaching as well (Miseducation). Within this teaching framework, students are encouraged to express their inner rage about America or people of another color. Teachers are reprogrammed to function as social justice counselors. Students become social justice warriors. \\n \\nSocial Justice is not biblical justice. You can read &quot;Fault Lines&quot; by Voddie Baucham to learn more. Watch a video by Voddie Baucham entitled &quot;Social Justice v. Biblical Justice&quot;. Or, you can read &quot;Why Social Justice is Not Biblical Justice&quot; by Scott David Allen. I also recommend &quot;Christianity and Wokeness&quot; by Owen Strachan. Lastly, read &quot;Confronting Injustice without Compromising Truth: 12 Questions Christians Should Ask About Social Justice&quot; by Thaddeus Williams. These works are helpful to understand the problem addressed here.\\n\\nThe Resolution Team received my thoughts in a 38-page document. They did not actively try to connect with me on the matter. They simply said it was &quot;received&quot;. This message came from Rebecca Loar. I have no evidence that they wish to resolve the matter.\"},{\"author\":\"Tracy G.\",\"datePublished\":\"2022-06-20\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"GCU helps prepare its students for the real world. The curriculum was a mix of challenging, and informative. It even went along with the real-world experience I already have. The teachers were responsive but will not hold your hand, nor should they be expected to. It is college, not high school. You do need to understand technology to be successful. Again though, in today&apos;s world to be successful in general you need to understand technology. The resources GCU gives its students to succeed are second to know. Students just need to use those resources.\"},{\"author\":\"Mark B.\",\"datePublished\":\"2022-08-03\",\"reviewRating\":{\"ratingValue\":3},\"description\":\"Just OK. The online hours work great with a busy life. The private school is very expensive, and I was getting a discount as a city employee. Some classes felt unnecessary, and I wish GCU had just said &quot;give us extra money to get through this class.&quot; I have not taken any other college classes online, so I have nothing to compare my experience to. My degree was in Homeland Security and Emergency Management.\"},{\"author\":\"Michele B.\",\"datePublished\":\"2022-01-23\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"GCU was great for my busy schedule, working 16 hour days and weekends. The professors and staff were great.  I love the experience at GCU and would recommend them.  \\n\\nMichele Boigris\"},{\"author\":\"Shacara J.\",\"datePublished\":\"2022-08-30\",\"reviewRating\":{\"ratingValue\":2},\"description\":\"Do not recommend for online learning. There systems are not setup to protect or assist online students. If you have an issue with a professor, you are ignored and ultimately will end up paying for that same class again. I attended for my Bachelors and quickly changed schools for my Masters.\"},{\"author\":\"Kathy K.\",\"datePublished\":\"2021-12-04\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"I personally have had a great experience with GCU. \\n\\nMy academia journey started many moons ago. I have been through many online programs. GCU was by far the most user friendly. \\n\\nI saw that some folks had issues with instructors. A little advice, yes, not all of them are there to take their chosen path to heart. But others truly have the passion to teach. Remember, they aren&apos;t here to give you a grade. You ARE there to EARN your grade and degree. If there are instructor issues continually email them. Not everything is perfect, so suck it up. \\n\\nI will be continuing onto the Master&apos;s program with GCU. I will also be looking into their Doctoral programs. I personally LOVE the platform. My financial person is by far the BEST!!! Mike G!!! \\n\\nI would 100% recommend this school to anyone.\"},{\"author\":\"Karla B.\",\"datePublished\":\"2022-09-13\",\"reviewRating\":{\"ratingValue\":1},\"description\":\"I completed a Master&apos;s degree from Grand Canyon University, completely online. It was challenging and I did not have overly-supportive professors -- but I finished it quickly and graduated with a GPA just under 4.0. \\n\\nHowever. Post-graduation, GCU&apos;s &quot;customer service&quot; is terrible! I have taught high school 11 years in the west and (because of my husband&apos;s job) have moved to a state on the east coast. In order to get my teaching certificate here, I needed official transcripts from my undergraduate and graduate schools. My undergraduate was at WSU, where I ordered a transcript online in under 2 minutes. GCU is not automated (weird for an online school). The only option is to call and speak to my &quot;advisor.&quot; After being on a lengthy hold, I was told that he was with a student and to leave a message. It took several attempts before I got through to him. I found out after the fact (from him)  that he had been out of town the whole week, yet every time I called student services told me he &quot;was with a student.&quot; After this long delay they then told me they had to MAIL the transcript! I had ordered an electronic transcript just 2 months earlier. I was told that was only because of Covid and they had since stopped doing electronic transcripts. The trouble was -- my application was all digital. All my forms were submitted to a digital application with Dept of Ed. I tried to explain this and was told &quot;no exceptions!&quot; I took it to a supervisor (which took one whole day for him to get back to me) and his position was that the Dept of Ed had to make the exception, not GCU. I had to call my state Dept of Ed to get an address for the mailed transcript. More and more delays. \\n\\nThe transcript was finally sent. Then the Dept of Ed required a verification form to be filled out by the &quot;preparing institution.&quot; So I had to start the process all over again. This time I had to speak with my &quot;counselor.&quot; And OF COURSE she was not available. I left three messages on her VM. Finally, after much pleading GCU allowed me to talk to another counselor, who had me email the form to my counselor of record, saying it would be processed by &quot;the end of the day.&quot; That was three weeks ago!! Nothing. I have called and left messages once a week and emailed her once a week (for three weeks). SHE HAS NOT REPLIED TO A SINGLE MESSAGE OR EMAIL. And she did not send the form. \\n\\nI started my new job 2 weeks ago. The school had to remand me to substitute status: I am paid the sub per diem (significantly less), I cannot have medical benefits, and I do not accrue sick leave. Until the Dept of Ed gets that form. One form is holding everything up! \\n\\nToday I got an email from a completely different counselor, telling me I have to submit an additional form before GCU will send the verification form. On this form I have to confirm that &quot;the state I reside in does not require test scores before issuing a certificate.&quot; But the state does require test scores -- and I have already sent them my test scores. My Praxis, West-E, and West-B test scores have nothing to do with GCU. I didn&apos;t take the tests through GCU, this is not their preview! I am SO frustrated!! I feel like I&apos;m being held hostage by this school. \\n\\nAnd every time I call -- I have to go through the gauntlet with the &quot;student services&quot; (which is a misnomer if I ever heard one -- they are the opposite of service) person BEFORE I can talk to a counselor or advisor. I have to give them my address, my phone number, my social security number, my email address, AND I have to answer a security question. Every. Single. Time. And then I&apos;m put on hold forever. Just to get a voicemail recording. Make an online option available!! It&apos;s 2022!\\n\\nSo, if you&apos;re thinking of attending GCU, because its a nice online option -- be warned! GCU does not care about their students after they graduate.\"}],\"aggregateRating\":{\"@type\":\"AggregateRating\",\"ratingValue\":3,\"reviewCount\":367}}"]},
{"data": ["{\"@context\":\"https://schema.org\",\"@type\":\"LocalBusiness\",\"name\":\"Southwest School of Woodworking\",\"image\":\"https://s3-media0.fl.yelpcdn.com/bphoto/J8KBQ16f25JoQyDKLx_Qbw/l.jpg\",\"telephone\":\"(480) 734-0274\",\"address\":{\"streetAddress\":\"621 N 7th Ave\",\"addressLocality\":\"Phoenix\",\"addressCountry\":\"US\",\"addressRegion\":\"AZ\",\"postalCode\":\"85007\"},\"review\":[{\"author\":\"Ciara B.\",\"datePublished\":\"2021-12-11\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"I took the Fundamentals class part 1 and learned a lot. I wanted to learn how to use hand tools and do joinery and that is exactly what I learned. The teachers are absolutely incredible and the atmosphere is focused but also fun. The location of the school is very far from my home or else I&apos;d already be signed up for Fundamentals part 2!\"},{\"author\":\"Gabe F.\",\"datePublished\":\"2021-05-03\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"Just took a cutting board class and had a awesome time.  Instructor Doug  and assistant Bryan did a great job.  Explained every detail thoroughly. Walked us all through every step.  Raul the director was also onsite to assist.  They have professional grade power tools and equipment.  From the jointers to planers to bad saws and table saw.  They have every wood working tool you would ever need to complete the project.  I made a couple pr cutting boards during my 2 day weekend class.  Had a great time.\"},{\"author\":\"Nicole C.\",\"datePublished\":\"2020-08-24\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"Took my first class at this school and it was awesome!  I took the serving tray and cutting board class.  No previous experience was necessary.  The teachers were fantastic. Very patient and helping students along. I learned how to use the table saw, planer, jointer, gluing and LOTS of sanding. I can&apos;t wait to sign up for more classes.\"},{\"author\":\"Linda D.\",\"datePublished\":\"2017-10-29\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"Such a great place. Some beautiful craftsmanship. There are great instructors who really care about woodworking and passing on the craft. They have many classes and guest instructors. Come see it if you are in any way interested in woodworking!!\"},{\"author\":\"Ted D.\",\"datePublished\":\"2019-02-09\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"I Took Fundamentals of Woodworking I, II, III at the Southwest School of Woodworking under the watchful eyes of Raul Ramirez.  There are no shortcuts at this School - it&apos;s hand-cut dovetails (through and half-blind) and hand planes.  Initially, cutting and cleaning up dovetails was very tedious work but eventually your skill-set improves and dovetails become a thing of function and form.  You will begin to really appreciate the &quot;up close and personal&quot;  relationship with wood.  I recommend this school without hesitation.  If you want to learn woodworking, this school is for you.\"}],\"aggregateRating\":{\"@type\":\"AggregateRating\",\"ratingValue\":5,\"reviewCount\":5}}"]},
{"data": ["{\"@context\":\"https://schema.org\",\"@type\":\"LocalBusiness\",\"name\":\"Waldorf Desert Marigold School\",\"image\":\"https://s3-media0.fl.yelpcdn.com/bphoto/48MzbQcd8k0TOY2pwTejfQ/l.jpg\",\"telephone\":\"(602) 243-6909\",\"address\":{\"streetAddress\":\"6210 S 28th St\",\"addressLocality\":\"Phoenix\",\"addressCountry\":\"US\",\"addressRegion\":\"AZ\",\"postalCode\":\"85042\"},\"review\":[{\"author\":\"Camille H.\",\"datePublished\":\"2019-09-06\",\"reviewRating\":{\"ratingValue\":1},\"description\":\"We initially were drawn to the learning program which was supposed to be more intuitive, but after a while it became clear that intuitive learning and indeed the entire Steiner system is indoctrination into a kind of cult more than a pedagogy.  \\n\\nThe focus is on Eurythmy, painting, handwriting, gnomes, elves, faeries and imaginary new age holidays. Its all very charming, but nobody&apos;s learning much. Children leave the program academically far behind their peers in traditional schools. In addition DMS has a trying time retaining teachers in some classes for any length of time. \\n\\nIn addition to the lack of learning rigor, many parents have not immunized their children, in fact they have the second worse vaccination rate in the state. \\n\\nWorst of all however is the terrible discipline and discipline problems; If a child misbehaves he has a heavy weight put on his lap, which is just cruel, not efficacious in any way. \\n\\nFinally, there is a lax attitude about drugs-many parents are open drug users. \\n\\nI brought a friend along to a children&apos;s performance one evening and she was offered marijuana by an employee even, not surreptitiously at all. On balance, this is a terrible place to leave your children for any period of time.\"},{\"author\":\"Krista K.\",\"datePublished\":\"2017-11-22\",\"reviewRating\":{\"ratingValue\":4},\"description\":\"The books are used. They have bookshelves full of them. The difference is not having a set book for each subject each year. They learn from multiple modalities- I have seen my son do research projects that last for weeks and require looking up information and learning from multiple books, websites, encyclopedias and so on. I have leaned to appreciate that while the method of learning is different from what I see for other schools, I see my child learning to learn- not memorizing from rote alone. He follows the same curriculum the district requires and is learning how to think for himself and form ideas and thoughts.  It&apos;s been different but I have learned to really appreciate that this type of education is perfect for my child and has not drummed a love of learning and discovering out of him. He has maintained his joy is learning new information and assimilating it.\\n\\nAs for drugs, I have not been offered anything from anyone in the 7 years we have been here. I am not naive enough to think that there are no drugs, but I also know that they are very present everywhere, not just this school. My junior high and high school had drug busts over 30 years ago in a middle class neighborhood. My answer is to teach my child about drugs, resisting drugs and peer pressure and why people use. \\n\\nI have to agree that the vaccination rate is low but my response is to fully vaccinate my child. Until we have a law (like California), people will be able to refuse to vaccinate based on their personal beliefs.\"},{\"author\":\"Jeff T.\",\"datePublished\":\"2020-06-19\",\"reviewRating\":{\"ratingValue\":1},\"description\":\"This school was at one time an oasis in the desert. The campus was magical, charming, and was welcoming everyday. The teachers and faculty were some of the best at teaching the great Waldorf system. It used to be an honor to have our child at this school.\\n\\nAs of 2018, this began to fall apart. Changes at the school, starting with a new and quite ignorant / arrogant administrator, undermined the methodology that made this school the best school Phoenix. Her goal, from the start, was to dismantle what made the school great and turn it into a more conventional school, which Arizona already has too many of. Soon, most of the best and brightest teachers left the school, leaving almost no qualified Waldorf teachers. One or two have stayed, at least for now, but the rest are hardly worth speaking about. The majority of the teachers left speak enough Waldorf to be convincing to someone who is new to the school system, but in reality lack any deep experience or how to apply it. In the end, it has no business being associated to the Waldorf name.\\n\\nThere are other Waldorf schools in Tucson and near Sedona and Prescott if you truly want knowledgeable, experienced Waldorf teachers. Waldorf is a great system and can make an enormous difference in your child&apos;s life and development. Arizona would be smart to encourage more Waldorf schools, especially charter or, even better yet, public.  But Desert Marigold is ill equipped to do anything more than hundreds of conventional schools in the area. If the other Waldorf schools in Arizona are not an option, unfortunately the only other choice is to move to a state that has a better selection of Waldorf schools, such as California or Color.\"},{\"author\":\"Stacey S.\",\"datePublished\":\"2016-10-06\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"We came to DMS from the public school system, and I am so grateful We did. Small class sizes, great teachers and staff who really know and care about students, and a challenging curriculum that includes the arts! My son has come out of his shell and is flourishing here! Love DMHS\"},{\"author\":\"Maria V.\",\"datePublished\":\"2017-03-28\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"I homeschooled my child for her first 7 years. We found this school and decided to make a change. I am very impressed with the learning that takes place here. When they say they make there own books you need to understand what this means. The students are given lectures and need to take notes with these notes the form many drafts on the topic. They do a lot of very impresseve writing and study of the subject where it be science, history and language arts. You would never get in any other school. The children are very kind and welcoming to everyone. I love this school.\"},{\"author\":\"Wes A.\",\"datePublished\":\"2015-01-15\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"This is the perfect place for our daughters.  If you know anything about Waldorf education, you probably already have a strong opinion about it one way or the other and nothing I write will probably change that.  Regardless, we really like this school!\"},{\"author\":\"Stefan M.\",\"datePublished\":\"2013-08-01\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"Commenting on Camille H.: This is a very strange comment, because partly it makes fun of the Waldorf approach (5 minutes on Google tells you what that means), and for the other part, it twists some facts of what Waldorf education means. Maybe the information at the tour was misleading, but don&apos;t judge a Waldorf school on Yelp if you don&apos;t like the Waldorf principles. I am also not going to give vegetarian restaurants a low rating because they don&apos;t serve meat.\"},{\"author\":\"L M.\",\"datePublished\":\"2013-05-11\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"Knowing that I couldn&apos;t evaluate a school based only on a tour, I investigated waldorf schools and enrolled my daughter in first grade.  She is now graduating as a senior.  I am so pleased with her education.  She will now enter ASU with high marks and test scores and beyond that, she is happy, fulfilled and a true individual.  I know that she benefited greatly from having the same teacher for seven years.  Her teacher understood her strengths and weaknesses fully and gave her exactly what she needed to be successful.  Never once was the teacher referred to as a spiritual guide or other such nonsense.  If you think this may be a school for your child, check it out fully.\"}],\"aggregateRating\":{\"@type\":\"AggregateRating\",\"ratingValue\":4,\"reviewCount\":8}}"]},
{"data": ["{\"@context\":\"https://schema.org\",\"@type\":\"LocalBusiness\",\"name\":\"It&apos;s All About Etiquette\",\"image\":\"https://s3-media0.fl.yelpcdn.com/bphoto/Hm8eoJdlZT-7SB5YghJmyA/l.jpg\",\"telephone\":\"(480) 510-6346\",\"address\":{\"streetAddress\":\"8202 E Cactus Rd\",\"addressLocality\":\"Scottsdale\",\"addressCountry\":\"US\",\"addressRegion\":\"AZ\",\"postalCode\":\"85259\"},\"review\":[{\"author\":\"Glen L.\",\"datePublished\":\"2021-11-05\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"I took SueAnn&apos;s course for adults earlier this year. I signed up thinking it would be a &quot;refresher&quot; course. To my shame, I realized that there was so much about etiquette that my Generation X crowd just never learned! From the proper way to shake hands to being a professional at the office, SueAnn is a wonderful teacher.\\n\\nAs someone who worked in human resources for over a decade, I expected to be more knowledgeable about the office section but SueAnn&apos;s content surprised me. She even had tips about working remotely and the use of mobile devices in both personal and professional settings.\\n\\nOne unexpected bonus our class received was being given a color analysis and learning which color clothing we look better in. We loved it!\\n\\nWhere the course really comes alive is with the meal and dining section. We all learned SO much! She lets you ask questions and you will learn how to be either a rock star host or a good guest. I WISH that I had taken this course sooner.\\n\\nIt&apos;s All About Etiquette offers many programs for children and teens. Parents, send your kids! Give your children a competitive advantage in life. These courses are worth every cent, especially when you consider that SueAnn has worked with many leading companies.\\n\\nIt&apos;s a shame that proper etiquette and good manners are declining in society. With this program, you can learn new skills and brush up on what you have forgotten! \\n\\nRecommend!\"},{\"author\":\"Suesan J.\",\"datePublished\":\"2019-07-26\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"Mrs. Brown does an excellent job teaching young children the importance of having etiquette.  I enrolled my daughter, 11yo, in the 4 day summer camp.  She had a great time and learned new skills that will benefit her for life.  I appreciate all the time and effort Mrs. Brown devotes to such a worthy and much looked over skill.  She was also very kind and accommodating with my daughter who has gluten issues on the day she taught table etiquette.\"},{\"author\":\"Kris C.\",\"datePublished\":\"2019-06-20\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"Mrs. Brown is amazing and I fully recommend her class!  She was able to get my daughter to do things (eye contact, proper hello, shake hands etc...) in only a few short sessions when I have tried for YEARS!  My daughter now sets the table &quot;the proper way&quot; and constantly tells me the &quot;proper way&quot; to do things.  My daughter will be taking this class again when she is older to review and reinforce what she has learned.  Mrs. Brown provides a manual for the parents to reinforce what the kids have learned at camp, as well as a place mat showing correct placements.  Invaluable information.\"},{\"author\":\"Filixt C.\",\"datePublished\":\"2019-06-14\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"my 6 yo daughter loved this class from day one. and I had to drag her to it initially. Mrs. Brown manages to motivate the kids to want to learn and then come home and teach the rest of us. will definitely sign up again and also sign up our sons when they are old enough. totally worth the drive!\"},{\"author\":\"Melissa A.\",\"datePublished\":\"2017-06-22\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"It&apos;s All About Etiquette was money well invested! My son learned many practical skill sets that will carry him well into adulthood. Mrs. Brown made it fun,  kept it current and relevant for today&apos;s pre-teens.  I can already foresee more classes for both sons. \\n\\nThank you Mrs. Brown for providing essential skills so easily forgotten in today&apos;s fast paced world. Grateful!\"},{\"author\":\"Melissa O.\",\"datePublished\":\"2014-07-24\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"My child was enrolled in Mrs. Brown&apos;s Summer Etiquette Camp this year.  What a wonderful three days my daughter had!  Every day she came home telling us what she learned that day in camp and what fun games they played and how much she loved the home made treats. To my amazement, she was setting the table the first night and asking if she could help clean up after dinner.\\n \\nMy daughter is very shy and I wanted her to feel more confident when meeting people.  I&apos;ve seen a wonderful improvement with her manners and can&apos;t thank \\nMrs. Brown&apos;s enough for her classes.  I would highly recommend her etiquette classes to anyone looking to improve their child&apos;s manners and social skills.\"},{\"author\":\"Gleason G.\",\"datePublished\":\"2017-01-16\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"I wanted to share with you the positive outcomes of your etiquette class.  My daughter and I recently attended a family wedding and everyone commented on her behavior.    She looked people in the eye when they greeted her and gave hugs and &quot;nice to meet you&quot; comments when appropriate. She even put her knife in the 1 o&apos;clock position when not using it.  I was so proud of her. Your wonderful class helped reinforce the manners we had been working on at home and showed her in a fun way how to remember them.  \\n \\nThank you again for a great experience. We hope to enroll our son in a future class.\"},{\"author\":\"Kristin C.\",\"datePublished\":\"2016-10-01\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"I highly recommend It&apos;s All About Etiquette. She gave a 20 minute presentation to a ASU Sorority and it was very well received. She was very organized, interesting and did a great job presenting useful information to girls who will be entering the work force as well as questions that some may have about everyday social graces. SueAnn is very professional and gives information that everyone needs. Thank you for your help in making our event a success!\"},{\"author\":\"Carrie L.\",\"datePublished\":\"2016-01-22\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"My daughter is currently enrolled in one of Mrs. Brown&apos;s Ettiquette classes and has attended her first session. Wow! My daughter was so enthusiastic when explaining what they did and what she learned! She was pleased with the class interaction and was eager to demonstrate her &quot;new skills&quot;! Best of all, she is looking forward to the next class...wanting to return without being bribed!! I call this a success! Thanks Mrs. Brown!\"},{\"author\":\"Marci H.\",\"datePublished\":\"2017-08-07\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"We have 3 children and really were excited to find Mrs. Brown and All About Etiquette. Our 9 year old boys started with Mrs. Brown early last year and the first class they took was an excellent introduction to Etiquette, every day manners, polite behavior and expectations, how to set a table, shake hands, look people in the eye when addressing them.... all the things as parents we struggle with teaching our kids and getting them to listen. SueAnn has a fantastic and very up-to-date, fun and informative way of teaching young people manners and communication truly is an important skill and they feel important learning from her. We enrolled our boys and 11 year old daughter in her summer camp and our daughter was mortified she had to go. The boys were ready for a refresher and learned to tie ties and open doors for people. They really did a wonderful job just repeating the skills and learning more ways to show appropriate behavior and appreciation.  Our daughter was far more resistant to attend however even afer the first day, she started dressing up just a bit and I could tell she was embracing some of her newly learned skills. One afternoon she was so excited to set the table and begged we take her to a fancy restaurant so she could practice with the forks and glasses appropriately. She proceeded to tell me how to set a proper table with desert spoons, multiple forks and wine and water glassware. She also was excited for her meet the teacher event at school because she now knew how to approiately introduce her father and I to her teacher and other adults. When  I asked her to show me she did so and it brought tears to my eyes at how poised and confident she was. She no longer fought with me about bringing her iPod to the dinner table and scolded me when I checked my texts, giving me all sorts of texting dos and don&apos;ts. However, I must say one of the best things was when we were school shopping and she looked at a pair of jeans with a rip in them and said, &quot;oh Mom, these jeans aren&apos;t classy for certain places. Mrs. Brown taught me what clothes are appropriate! &quot;  Keep in mind, she still wears t-shirts and shorts everyday but there is hope for the future! \\n\\nNow our daughter wants to know what class she gets to take next with Mrs. Brown. I can&apos;t say enough how valuable her skills and experience translate into her down to earth teaching.  Each class the kids have taken they have come home with an in depth, 3 ring binder full of information for reference and further  practice. She is patient and passionate about what she does. We will be enrolling our kids in classes with her for years to come! Thank you, SueAnn.\"},{\"author\":\"Jennifer U.\",\"datePublished\":\"2018-07-22\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"My kids, 9 (boy) and 11 (girl), were so against going to etiquette camp, but Sue Brown promised a fun time, and she delivered!  After the first day, our kids were so excited to go back and even did their &quot;homework&quot;.  Mrs. Brown made it so enjoyable and a fun learning experience that my kids even opted out of leaving for vacation a day early so they could attend the last day of class and the graduation ceremony.  Mrs. Brown made our kids feel welcome and important and taught them solid fundamentals in etiquette.  What a great opportunity to have someone else do what every parent tries to do at home, the impact seems to be different when it comes from a non-parent.  I highly recommend this camp! Jennifer\"},{\"author\":\"Stefanie G.\",\"datePublished\":\"2018-03-07\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"As an owner of a sales company we sent one of our employees to a private customized class. This was money well spent on refining a person who represents our image. I cant say enough about how wonderful Sue Ann was to work with. Detailed, very accommodating and thoughtful of my specific needs. In a society that is lacking etiquette and manners, students will come out shining.\"},{\"author\":\"Mary Ann M.\",\"datePublished\":\"2014-04-03\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"My 10 year old granddaughter attended Sue Ann&apos;s etiquette summer camp in July 2013, it was a wonderful experience! It was a three day class and my granddaughter enjoyed attending each and every session, looking forward to going back. \\nSue Ann is very knowledgeable professional and personable. SHE is an example of exactly the etiquette, integrity and manners you want your child to learn. Suzanne is also VERY good with children. Her class preparation was amazing, she had the room set up with beautiful table settings and decorations and gave the children home made treats and also sent them home with tools to use and share with their families. \\nMy granddaughter came home after the camp eager to show us her new manners and skills at the dinner table and beyond, it was refreshing to see her exhibit what she learned with enthusiasm. I will be enrolling all of my grandchildren in her summer classes this coming season. Thank you Sue Ann!\"},{\"author\":\"Sally V.\",\"datePublished\":\"2016-05-25\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"I live in a large housing development in the Southeast part of the valley.  I contacted Mrs. Brown to inquire about her teaching etiquette classes at our clubhouse for the children in the neighborhood.  She was very accommodating with the location, time/date of the classes, content and pricing.  She was very easy to deal with, and when she taught the classes, she turned out to be excellent with the kids.  We will definitely be contacting her again to teach more and higher level etiquette classes.  I highly recommend her firm.\"},{\"author\":\"Nurse G.\",\"datePublished\":\"2014-10-31\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"Sue Ann came and spoke to twenty 7th graders about teen manners and table manners.  The girls were all attentive and thoroughly enjoyed her.  Sue Ann had the girls &quot;make&quot; the table in their space and it really helped to visualize what they were learning.  Sue Ann was about to relate to the girls, handled questions throughout her presentation and overall did a fantastic job.  A few of the parents were talking that we should have come every year speak on age appropriate topics, and review table manners!  My daughter now points out some etiquette tips at dinner and we all are learning.  Sue Ann also gave a handout of what she covered and it really helps to keep that handy to review every once in awhile. \\nI will 100% be using It&apos;s All About Etiquette in the future.\"}],\"aggregateRating\":{\"@type\":\"AggregateRating\",\"ratingValue\":5,\"reviewCount\":15}}"]},
{"data": ["{\"@context\":\"https://schema.org\",\"@type\":\"LocalBusiness\",\"name\":\"Cactus Shadows High School\",\"image\":\"https://s3-media0.fl.yelpcdn.com/bphoto/y59gT6ZvhEMFV_cf-TYPoQ/l.jpg\",\"telephone\":\"(480) 575-2400\",\"address\":{\"streetAddress\":\"5802 E Dove Valley Rd\",\"addressLocality\":\"Cave Creek\",\"addressCountry\":\"US\",\"addressRegion\":\"AZ\",\"postalCode\":\"85331\"},\"review\":[{\"author\":\"Cindy C.\",\"datePublished\":\"2017-02-24\",\"reviewRating\":{\"ratingValue\":4},\"description\":\"It&apos;s not a surprise that those who have strong feelings about a business often take out their frustrations on-line which equates to bad reviews. This tends to skew the ratings. I think that&apos;s what happens to most schools; this school not being an exception. I don&apos;t think there are any perfect schools; they all have good and the bad. It&apos;s ultimately what the students decide to take advantage of. \\n\\nThis school offers great programs for the gifted. They offer both the IB and AP courses. I don&apos;t believe many schools offer both. I&apos;ve heard of students commuting from Anthem for their IB program. \\n\\nThey are spending lot of money recently in building/renovating sports facilities. The fine arts building also went through a major facelift. They also put in a new parking lot for junior students. \\n\\nIf you have a music student, this school lacks in funding for their music program. Currently very small band and almost nonexistent marching band, although they are trying to improve in this area.\\n\\nHowever, they have great counselors that seems to care for the students. They meet with individual students periodically to make sure they are on the right track.\\n\\nAs for the teachers, there are many great teachers. You know...the ones that actually enjoy teaching. There are few bad apples, but that&apos;s expected everywhere. \\n\\nAs for the smoking/drinking/drugs. Honestly, that is everywhere; it is high-school after all. I think we just need to teach our own kids to stay away from that. I was told by my son that it is present on campus but if you&apos;re not into that, there&apos;s no peer pressure.\"},{\"author\":\"Nya L.\",\"datePublished\":\"2022-01-14\",\"reviewRating\":{\"ratingValue\":1},\"description\":\"So I am here for a basketball during a pandemic, they are making everyone sit on 1 side of the gym as a precaution, but the gym smells really bad, it is hot &amp; it&apos;s looks like it has not been cleaned in months. So I am sure the bleachers have not been cleaned and/or sanitized. It kills me and all I do is laugh!!! They want to take all these precautions in this nasty ass gym! This school is in this nice neighborhood &amp; all? Looking like this. I wouldn&apos;t send my student here.\"},{\"author\":\"Destry M.\",\"datePublished\":\"2022-01-24\",\"reviewRating\":{\"ratingValue\":1},\"description\":\"I was told at the end of my junior year that my math credit I obtained in this district&apos;s middle school didn&apos;t actually matter and that I now had to take Calculus while the rest of my class was allowed to take precalculus (which I obtained my junior year). The counseling department is atrocious when it comes to their job and when I vocalized my opinion to them regarding this problem, I was silenced. The counselors do not care about your student. Don&apos;t punish your child with this place, not until the counseling department is completely replaced. Hoping at least SOMEONE in administration reads this so someone knows there&apos;s a problem.\"},{\"author\":\"Abryanne B.\",\"datePublished\":\"2021-04-26\",\"reviewRating\":{\"ratingValue\":1},\"description\":\"If I could rate Cactus Shadows High School 0 stars I would. Cave Creek Unified School Districs 93 local highschool, Cactus Shadows, is unfit and unsafe. Staff is unpleasant and extremely unhelpful and not true to their word. Almost 95% of students have or partske in illegal drug activity on campus. Some students refer to thsi highschool as a &quot;Crackhouse&quot;. Do yourself a favor and do not send your children to this highschool.\"},{\"author\":\"Nigel M.\",\"datePublished\":\"2020-06-12\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"My grandson Evan just finished his freshman year having been in Horseshoe Trails Elementary and Sonoran Trails Middle school.  I am extremely pleased with all three schools teachers and administration and how they have developed Evan into a very good student.  While there are always some issues at the school I can say that if you get involved, meet with the teachers and councilors, understand what they have to deal with as well as the security aspects, you will find a lot of support.  We are looking forward to the next 3 years with all the trials and tribulations of the COVID-19 to deal with too!\"},{\"author\":\"Sammy M.\",\"datePublished\":\"2019-07-14\",\"reviewRating\":{\"ratingValue\":1},\"description\":\"One of the worst high schools in existence. Security is pathetic and mouthy to students. Administration lacks proper authority and fails to address critical issues. Teachers are struggling every year due to the lack of proper classroom sizes 35/37. Teacher bias is common. Called cshs shithole for a reason.\"},{\"author\":\"Brennan W.\",\"datePublished\":\"2019-08-29\",\"reviewRating\":{\"ratingValue\":1},\"description\":\"Worst school to exist, no security or quality teachers. This is debatably the worst school in arizona\"},{\"author\":\"O B.\",\"datePublished\":\"2017-02-11\",\"reviewRating\":{\"ratingValue\":5},\"description\":\"Great school for students who wants to study. Great teachers!!! Great library and spacious!!!\"},{\"author\":\"Marvin S.\",\"datePublished\":\"2016-06-06\",\"reviewRating\":{\"ratingValue\":1},\"description\":\"These freshman would have sex everyday in the bathroom by the library and security new because one of the security people would stand by the bathroom while it occurred. Fucking disgusting... They even smoke weed in class. Don&apos;t go there. Everyone there is either fucking or getting high.\"},{\"author\":\"Justin A.\",\"datePublished\":\"2017-04-21\",\"reviewRating\":{\"ratingValue\":1},\"description\":\"Cactus Shadows has earned its rightful nickname, Cactus Shithole. The whole school is trashed, literally garbage everywhere. The security is terrible, they barge in on people who are using the rest room because vaping has become such a big problem. The teachers are terrible, they care more about pay raises from the principal then they do about staying for office hours. The school would rather pay for new grass, new athletic buildings, and new fine arts center updates(such as the 60,000$ curtains they bought...) The worst teacher by far is Brittany Dodd, the current cheer coach. She cares more about the cheer team then about school, she will have cheerleaders come sit with her during class, and completely forget about her students. As for when the cheerleaders aren&apos;t there, she gives out loads of assignments, without any explanation, and continues to sit at her desk and watch twitter videos and snapchat her cheerleaders. The administration is a joke because they care more about attendance then they do about students safety and well being. Bullying is such a big problem here I had to pull my kid out. The school suspends kids for missing too much school, which is insane. How they managed to pull off an A+ rating blows my mind. This school needs a major facelift.\"}],\"aggregateRating\":{\"@type\":\"AggregateRating\",\"ratingValue\":2,\"reviewCount\":10}}"]},
{"data": []}
]